# Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
l = [['moon', 'sun', 'stars',np.nan],[45,12,None,5,],['Good','Null']]

In [8]:
d = pd.DataFrame(l,index = ['a', 'b','c'])

In [9]:
d

      0     1      2    3
a  moon   sun  stars  NaN
b    45    12   None  5.0
c  Good  Null   None  NaN

In [10]:
d.dropna(axis = 1)

      0     1
a  moon   sun
b    45    12
c  Good  Null

In [11]:
d.fillna('ROZINA')

      0     1       2       3
a  moon   sun   stars  ROZINA
b    45    12  ROZINA     5.0
c  Good  Null  ROZINA  ROZINA

In [12]:
d.isnull()

       0      1      2      3
a  False  False  False   True
b  False  False   True  False
c  False  False   True   True

In [13]:
d.notnull()

      0     1      2      3
a  True  True   True  False
b  True  True  False   True
c  True  True  False  False

# Filtering Out Missing Data

In [14]:
from numpy import nan as NA

In [15]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [16]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA, NA],
                    [NA,NA,NA],[NA,6.5, 3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned = data.dropna()

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[4] = NA

In [25]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
df = pd.DataFrame(np.random.randn(7,3))

In [28]:
df

          0         1         2
0 -0.182584 -0.609100  0.874621
1 -0.282630 -0.556695  1.585278
2 -1.890580  0.280051  0.309739
3 -0.477042  0.656525 -0.813844
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

In [29]:
df.iloc[:4, 1] = NA

In [30]:
df.iloc[:2, 2] = NA

In [31]:
df

          0         1         2
0 -0.182584       NaN       NaN
1 -0.282630       NaN       NaN
2 -1.890580       NaN  0.309739
3 -0.477042       NaN -0.813844
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

In [32]:
df.dropna()

          0         1         2
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

In [33]:
df.dropna(thresh = 2)

          0         1         2
2 -1.890580       NaN  0.309739
3 -0.477042       NaN -0.813844
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

# Filling In Missing Data

In [34]:
df.fillna(0)

          0         1         2
0 -0.182584  0.000000  0.000000
1 -0.282630  0.000000  0.000000
2 -1.890580  0.000000  0.309739
3 -0.477042  0.000000 -0.813844
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

In [35]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.182584  0.500000  0.000000
1 -0.282630  0.500000  0.000000
2 -1.890580  0.500000  0.309739
3 -0.477042  0.500000 -0.813844
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

In [36]:
_ = df.fillna(0, inplace = True)

In [37]:
df

          0         1         2
0 -0.182584  0.000000  0.000000
1 -0.282630  0.000000  0.000000
2 -1.890580  0.000000  0.309739
3 -0.477042  0.000000 -0.813844
4 -0.679706 -0.750048  2.079930
5  1.091720  1.535484  0.177625
6  0.387886  0.806937  0.860024

In [38]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [39]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [41]:
dt = pd.DataFrame(np.random.randn(5,5))

In [42]:
dt

          0         1         2         3         4
0 -0.127018  0.365342 -0.373056 -0.620866  0.260141
1 -0.005092 -1.430596 -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795 -1.404204
3  0.118943 -0.411092  1.374663 -0.687656 -1.356012
4  1.521961  0.029436  0.339250 -0.576914  0.152767

In [43]:
dt.iloc[:2,1] = np.nan
dt

          0         1         2         3         4
0 -0.127018       NaN -0.373056 -0.620866  0.260141
1 -0.005092       NaN -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795 -1.404204
3  0.118943 -0.411092  1.374663 -0.687656 -1.356012
4  1.521961  0.029436  0.339250 -0.576914  0.152767

In [44]:
dt.iloc[3:,3] = NA
dt

          0         1         2         3         4
0 -0.127018       NaN -0.373056 -0.620866  0.260141
1 -0.005092       NaN -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795 -1.404204
3  0.118943 -0.411092  1.374663       NaN -1.356012
4  1.521961  0.029436  0.339250       NaN  0.152767

In [45]:
dt.fillna(value = 1998)

          0            1         2            3         4
0 -0.127018  1998.000000 -0.373056    -0.620866  0.260141
1 -0.005092  1998.000000 -1.134146    -1.634181 -1.068491
2  1.927175    -0.414670 -0.650781    -0.023795 -1.404204
3  0.118943    -0.411092  1.374663  1998.000000 -1.356012
4  1.521961     0.029436  0.339250  1998.000000  0.152767

In [46]:
dt.fillna('ffill')

          0         1         2         3         4
0 -0.127018     ffill -0.373056 -0.620866  0.260141
1 -0.005092     ffill -1.134146 -1.634181 -1.068491
2  1.927175  -0.41467 -0.650781 -0.023795 -1.404204
3  0.118943 -0.411092  1.374663     ffill -1.356012
4  1.521961  0.029436  0.339250     ffill  0.152767

In [47]:
dt.fillna(axis = 1, value = 963)

          0           1         2           3         4
0 -0.127018  963.000000 -0.373056   -0.620866  0.260141
1 -0.005092  963.000000 -1.134146   -1.634181 -1.068491
2  1.927175   -0.414670 -0.650781   -0.023795 -1.404204
3  0.118943   -0.411092  1.374663  963.000000 -1.356012
4  1.521961    0.029436  0.339250  963.000000  0.152767

In [48]:
dt

          0         1         2         3         4
0 -0.127018       NaN -0.373056 -0.620866  0.260141
1 -0.005092       NaN -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795 -1.404204
3  0.118943 -0.411092  1.374663       NaN -1.356012
4  1.521961  0.029436  0.339250       NaN  0.152767

In [49]:
dt.fillna(value = 0, inplace = True)

In [50]:
dt

          0         1         2         3         4
0 -0.127018  0.000000 -0.373056 -0.620866  0.260141
1 -0.005092  0.000000 -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795 -1.404204
3  0.118943 -0.411092  1.374663  0.000000 -1.356012
4  1.521961  0.029436  0.339250  0.000000  0.152767

In [51]:
dt.iloc[2:,4] = np.nan

In [52]:
dt

          0         1         2         3         4
0 -0.127018  0.000000 -0.373056 -0.620866  0.260141
1 -0.005092  0.000000 -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795       NaN
3  0.118943 -0.411092  1.374663  0.000000       NaN
4  1.521961  0.029436  0.339250  0.000000       NaN

In [53]:
dt.fillna(method = 'ffill')

          0         1         2         3         4
0 -0.127018  0.000000 -0.373056 -0.620866  0.260141
1 -0.005092  0.000000 -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795 -1.068491
3  0.118943 -0.411092  1.374663  0.000000 -1.068491
4  1.521961  0.029436  0.339250  0.000000 -1.068491

In [54]:
dt.iloc[:2,1] = np.nan

In [55]:
dt

          0         1         2         3         4
0 -0.127018       NaN -0.373056 -0.620866  0.260141
1 -0.005092       NaN -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795       NaN
3  0.118943 -0.411092  1.374663  0.000000       NaN
4  1.521961  0.029436  0.339250  0.000000       NaN

In [56]:
dt.fillna(method = 'bfill')

          0         1         2         3         4
0 -0.127018 -0.414670 -0.373056 -0.620866  0.260141
1 -0.005092 -0.414670 -1.134146 -1.634181 -1.068491
2  1.927175 -0.414670 -0.650781 -0.023795       NaN
3  0.118943 -0.411092  1.374663  0.000000       NaN
4  1.521961  0.029436  0.339250  0.000000       NaN

# Data Transformation

# Removing Duplicates

In [57]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2' : [1, 1, 2, 3, 3, 4, 4]})

In [58]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [59]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [60]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [61]:
data['v1'] = range(7)

In [62]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [63]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data Using a Function or Mapping

In [64]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [65]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [66]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork': 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [67]:
lowercased = data['food'].str.lower()

In [68]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [69]:
data['animal'] = lowercased.map(meat_to_animal)

In [70]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [71]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing Values

In [72]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [73]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [74]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [75]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [76]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [77]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [78]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

In [79]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [80]:
transform = lambda x: x[:4].upper()

In [81]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [82]:
data.index = data.index.map(transform)

In [83]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [84]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [85]:
data.rename(index = {'OHIO': 'INDIANA'},
           columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [86]:
data.rename(index = {'OHIO': 'INDIANA'}, inplace = True)

In [87]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [88]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [89]:
bins = [18, 25, 35, 60, 100]

In [90]:
import pandas as pd
cats = pd.cut(ages, bins)

In [91]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [92]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [93]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [94]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [95]:
len(ages)

12

In [96]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [97]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [98]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [99]:
import numpy as np
data = np.random.randn(20)

In [100]:
data

array([ 0.72938301,  0.68127053, -0.15282345,  1.31468307,  0.58651245,
       -1.50416519, -0.65646353, -0.49630455,  0.58849874,  0.47410693,
       -0.31262188, -0.86215036,  0.78362222, -0.51209571,  1.1740831 ,
        0.26181198,  0.77223426,  0.04228628, -0.14972006, -1.41667494])

In [101]:
pd.cut(data, 4, precision = 2)

[(0.61, 1.31], (0.61, 1.31], (-0.8, -0.095], (0.61, 1.31], (-0.095, 0.61], ..., (-0.095, 0.61], (0.61, 1.31], (-0.095, 0.61], (-0.8, -0.095], (-1.51, -0.8]]
Length: 20
Categories (4, interval[float64, right]): [(-1.51, -0.8] < (-0.8, -0.095] < (-0.095, 0.61] < (0.61, 1.31]]

In [102]:
data = np.random.randn(1000) # Normally distributed

In [103]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [104]:
cats

[(-0.0392, 0.62], (0.62, 2.917], (-0.71, -0.0392], (-3.106, -0.71], (-0.71, -0.0392], ..., (0.62, 2.917], (0.62, 2.917], (-0.0392, 0.62], (-0.0392, 0.62], (0.62, 2.917]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.106, -0.71] < (-0.71, -0.0392] < (-0.0392, 0.62] < (0.62, 2.917]]

In [105]:
pd.value_counts(cats)

(-3.106, -0.71]     250
(-0.71, -0.0392]    250
(-0.0392, 0.62]     250
(0.62, 2.917]       250
dtype: int64

In [106]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0392, 1.238], (-0.0392, 1.238], (-1.286, -0.0392], (-1.286, -0.0392], (-1.286, -0.0392], ..., (-0.0392, 1.238], (1.238, 2.917], (-0.0392, 1.238], (-0.0392, 1.238], (1.238, 2.917]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.106, -1.286] < (-1.286, -0.0392] < (-0.0392, 1.238] < (1.238, 2.917]]

# Detecting and Filtering Outliers

In [107]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [108]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007675    -0.009907     0.054985    -0.016641
std       0.977623     0.994930     1.008483     1.038701
min      -3.359741    -2.962294    -3.533319    -3.094045
25%      -0.670983    -0.691828    -0.625057    -0.708744
50%      -0.017764     0.020020     0.035950    -0.019409
75%       0.611507     0.629640     0.760759     0.666457
max       3.599496     3.695993     3.257257     3.159219

In [109]:
col = data[2]

In [110]:
col[np.abs(col) > 3]

321   -3.533319
325    3.257257
778   -3.423267
Name: 2, dtype: float64

In [111]:
data[(np.abs(data) > 3).any(1)]

C:\Users\Admin\AppData\Local\Temp\ipykernel_3076\2969116195.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data) > 3).any(1)]

            0         1         2         3
23   0.537599  1.161582  1.040753  3.085338
246 -0.908027  3.695993 -0.514915  0.480243
321 -0.380090  0.548210 -3.533319  1.231234
325  2.304021 -0.772176  3.257257 -1.363879
334 -3.359741 -0.932945  0.877451 -1.267877
369  3.283504  1.763875 -0.454917 -1.739558
422 -0.389676 -0.354850 -1.131047  3.156114
493  3.599496 -1.581923 -1.407237 -0.797856
500  1.003897  3.057524  0.640071 -0.996009
602  3.067999  0.045191  1.353386  0.189120
778  0.404013 -0.508072 -3.423267  0.116997
842  1.097530  0.240531 -0.720904 -3.094045
982  0.046075 -0.890135 -1.766703  3.159219
998  0.234728  0.947914 -0.377574 -3.085302

In [112]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008266    -0.010660     0.055684    -0.016862
std       0.973288     0.992399     1.004559     1.036983
min      -3.000000    -2.962294    -3.000000    -3.000000
25%      -0.670983    -0.691828    -0.625057    -0.708744
50%      -0.017764     0.020020     0.035950    -0.019409
75%       0.611507     0.629640     0.760759     0.666457
max       3.000000     3.000000     3.000000     3.000000

In [114]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0 -1.0 -1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4 -1.0  1.0  1.0 -1.0

# Permutation and Random Sampling

In [115]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [116]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [117]:
sampler = np.random.permutation(5)

In [118]:
sampler

array([3, 4, 0, 2, 1])

In [119]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [120]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7

In [121]:
df.sample(n = 3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [122]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [123]:
draws = choices.sample(n = 10, replace = True)

In [124]:
draws

2   -1
3    6
1    7
3    6
2   -1
0    5
0    5
3    6
2   -1
0    5
dtype: int64

# Computing Indicator/Dummy Variables

In [125]:
import pandas as pd

In [126]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [127]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [128]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [129]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [130]:
df_with_dummy = df[['data1']].join(dummies)

In [131]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [132]:
mnames = ['movie_id', 'title', 'genres']

In [133]:
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [134]:
movies[:10]

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [135]:
all_genres = []

In [136]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [137]:
genres = pd.unique(all_genres)

In [138]:
genres

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [139]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [140]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [141]:
gen = movies.genres[0]

In [142]:
gen.split('|')

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

In [143]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2, 3, 4], dtype=int64)

In [144]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [145]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [146]:
movies_windic.iloc[0]

movieId                                                               1
title                                                  Toy Story (1995)
genres                      Adventure|Animation|Children|Comedy|Fantasy
Genre_Adventure                                                     1.0
Genre_Animation                                                     1.0
Genre_Children                                                      1.0
Genre_Comedy                                                        1.0
Genre_Fantasy                                                       1.0
Genre_Romance                                                       0.0
Genre_Drama                                                         0.0
Genre_Action                                                        0.0
Genre_Crime                                                         0.0
Genre_Thriller                                                      0.0
Genre_Horror                                                        0.0
Genre_Mystery                                                       0.0
Genre_Sci-Fi                                                        0.0
Genre_War                                                           0.0
Genre_Musical                                                       0.0
Genre_Documentary                                                   0.0
Genre_IMAX                                                          0.0
Genre_Western                                                       0.0
Genre_Film-Noir                                                     0.0
Genre_(no genres listed)                                            0.0
Name: 0, dtype: object

In [147]:
movie = pd.DataFrame(movies_windic)
movie.head()

,movieId,title,genres,Genre_Adventure,Genre_Animation,Genre_Children,Genre_Comedy,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Horror,Genre_Mystery,Genre_Sci-Fi,Genre_War,Genre_Musical,Genre_Documentary,Genre_IMAX,Genre_Western,Genre_Film-Noir,Genre_(no genres listed)
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1.0,1.0,1.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children|Fantasy,1.0,0.0,1.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,0.0,1.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,0.0,0.0,0.0,1.0,0.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [148]:
len(movies_windic)

9742

In [149]:
import numpy as np
np.random.seed(12345)

In [150]:
values = np.random.rand(10)

In [151]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [152]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [153]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# String Manipulation

# String Object Methods

In [154]:
val = 'a,b,  guido'

In [155]:
val.split(',')

['a', 'b', '  guido']

In [156]:
pieces = [x.strip() for x in val.split(',')]

In [157]:
pieces

['a', 'b', 'guido']

In [158]:
first, second, third = pieces

In [159]:
first + '::' + second + '::' + third

'a::b::guido'

In [160]:
'::'.join(pieces)

'a::b::guido'

In [161]:
'guido' in val

True

In [162]:
val.index(',')

1

In [163]:
val.find(':')

-1

In [164]:
val.index(':') #  not present

ValueError: substring not found

In [165]:
val.count(',')

2

In [166]:
val.replace(',', '::')

'a::b::  guido'

In [167]:
val.replace(',', '')

'ab  guido'

In [168]:
r = 'ROZINA RAZZAK, 1985, KARACHI,'

In [169]:
r.count(',')

3

In [170]:
r.endswith(',')

True

In [171]:
r.startswith(',')

False

In [172]:
t = 'PAKISTAN, COUNTRY'
t.join('\\\\')

'\\PAKISTAN, COUNTRY\\'

In [173]:
o = [x.strip() for x in t.split(',')]

In [174]:
'$$'.join(o)

'PAKISTAN$$COUNTRY'

In [175]:
t.index(',')

8

In [176]:
r.index('A')

5

In [177]:
t.find('R')

15

In [178]:
len(t)

17

In [179]:
r.find('20')

-1

In [180]:
t

'PAKISTAN, COUNTRY'

In [181]:
t.rfind('')

17

In [182]:
r.rfind('1998')

-1

In [183]:
r

'ROZINA RAZZAK, 1985, KARACHI,'

In [184]:
r.replace('KARACHI', 'PAKISTAN')

'ROZINA RAZZAK, 1985, PAKISTAN,'

In [185]:
piece = [x.strip() for x in r.split(',')]

In [186]:
piece

['ROZINA RAZZAK', '1985', 'KARACHI', '']

In [187]:
piece[2]

'KARACHI'

In [188]:
r[2]

'Z'

In [189]:
fi = 'hooo,ooo   ,   lp'

In [190]:
[x.rstrip() for x in fi.split()]

['hooo,ooo', ',', 'lp']

In [191]:
[x.lstrip() for x in fi.split()]

['hooo,ooo', ',', 'lp']

In [192]:
fi.lstrip()

'hooo,ooo   ,   lp'

In [193]:
fi.split(':')

['hooo,ooo   ,   lp']

In [194]:
g = fi.split(',')
g

['hooo', 'ooo   ', '   lp']

In [195]:
len(g)

3

In [196]:
g[0]

'hooo'

In [197]:
g[2]

'   lp'

In [198]:
g[1]

'ooo   '

In [199]:
print(r)
print(r.lower())

ROZINA RAZZAK, 1985, KARACHI,
rozina razzak, 1985, karachi,

In [200]:
p = r.lower()
print(p)
p.upper()

rozina razzak, 1985, karachi,

'ROZINA RAZZAK, 1985, KARACHI,'

In [201]:
r

'ROZINA RAZZAK, 1985, KARACHI,'

In [202]:
r.casefold()

'rozina razzak, 1985, karachi,'

In [203]:
r.ljust(1)

'ROZINA RAZZAK, 1985, KARACHI,'

In [204]:
r.ljust(5)

'ROZINA RAZZAK, 1985, KARACHI,'

In [205]:
r.rjust(2)

'ROZINA RAZZAK, 1985, KARACHI,'

In [206]:
r.center(50, '$')

'$$$$$$$$$$ROZINA RAZZAK, 1985, KARACHI,$$$$$$$$$$$'

In [207]:
r.rjust(40, '&')

'&&&&&&&&&&&ROZINA RAZZAK, 1985, KARACHI,'

In [208]:
r.ljust(40,'@')

'ROZINA RAZZAK, 1985, KARACHI,@@@@@@@@@@@'

# Regular Expression

In [209]:
import re

In [210]:
text = 'foo    bar\t baz   \tqux'

In [211]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [212]:
y = 'io pl    hbk knjkn  ikkkkkkk      '

In [213]:
re.split('\s+', y)

['io', 'pl', 'hbk', 'knjkn', 'ikkkkkkk', '']

In [214]:
regex = re.compile('\s+')

In [215]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [216]:
regex.findall(text)

['    ', '\t ', '   \t']

In [217]:
text = """ Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [218]:
pattern = r'[A-Z0-9._%+-]+@[A-z0-9.-]+\.[A-Z]{2,4}'

In [219]:
# re.IGNORECASE make the regex cass-insensitive

In [220]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [221]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [222]:
m = regex.search(text)

In [ ]:
m

In [ ]:
text[m.start():m.end()]

In [ ]:
print(regex.match(text))

In [ ]:
print(regex.sub('REDACTED', text))

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [ ]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [ ]:
m = regex.match('wesm@bright.net')

In [ ]:
m

In [ ]:
m.groups()

In [ ]:
regex.findall(text)

In [ ]:
print(regex.sub('ROZINA', text))

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

In [ ]:
print(regex.subn('Rozina', text))

In [ ]:
o = regex.finditer(text)

In [ ]:
for i in o:
    print(i)

# Vectorized String Functions in Pandas

In [ ]:
import numpy as np
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [ ]:
data

In [ ]:
import pandas as pd
data = pd.Series(data)
data

In [ ]:
data.isnull()

In [ ]:
data.str.contains('gmail')

In [ ]:
pattern

In [ ]:
data.str.findall(pattern, flags = re.IGNORECASE)

In [ ]:
matches = data.str.match(pattern, flags = re.IGNORECASE)

In [ ]:
matches

In [ ]:
data.str.get(1)

In [ ]:
matches.astype(str).str.get(1)

In [ ]:
matches.astype(str).str[0]

In [ ]:
data.str[:5]

In [ ]:
j = 'sddsadx dzdas, ads'
l = 'sdf5g'

In [ ]:
j.count(',')

In [ ]:
j.isalnum()

In [ ]:
len(j)

In [ ]:
l.isalpha()

In [ ]:
j.isdecimal()

In [ ]:
l.isdigit()

In [ ]:
j.islower()

In [ ]:
k = 'QWSSnm'
k.isupper()

In [ ]:
k.isnumeric()

In [ ]:
k.upper()

In [ ]:
k.lower()

In [ ]:
k.center(20, '#')

In [ ]:
e = '          Tg'
e.lstrip()

In [ ]:
d = '     gh          '
d.rstrip()

In [ ]:
f = 'bnbm,chbkjn,bkbk'
f.split(',')

In [ ]:
data

In [ ]:
f * 3

In [ ]:
s1 = 'ROZINA'
s2 = 'RAZZAK'
' ### '.join([s1,s2])

In [ ]:
import re
string = 'I love python'
pattern = 'python'
match = re.search(pattern, string)

In [ ]:
match

In [ ]:
if match:
    print(match.group())

In [ ]:
d = 'ROZINA RAZZAK IN PAKISTAN'
p = 'ROZINA'
x = 'IN'

In [ ]:
matches = re.findall(p,d)

In [ ]:
print(matches)

In [ ]:
matches1 = re.findall(x,d)

In [ ]:
matches1

In [ ]:
d.endswith(p)

In [ ]:
d.startswith(p)

In [ ]:
data

In [ ]:
f = pd.Series(['a3','b4', 'c5'])

In [ ]:
f.str.extract(r'([ac])(\d)')

In [ ]:
w = 'mnop'

In [ ]:
w[:1]

In [ ]:
f.str.slice(2)

In [ ]:
f.str.repeat(4)

In [ ]:
f.str.cat(sep = ',')

In [ ]:
f.str.replace('a3', 'g3')

In [ ]:
f

In [ ]:
f.str.pad(10)

# The End